# Parameters
nc: 1 # number of classes
scales:
  # [depth, width, max_channels]
  n: [1.00, 0.2, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, HWDA, [128]] # 1-P2/4
  - [-1, 1, HWDA, [256]] # 2-P3/8
  - [-1, 1, HWDA, [512]] # 3-P4/16
  - [-1, 1, HWDA, [1024]] # 4-P5/32
  - [-1, 1, ADP, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, MGE, [512]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, MGE, [256]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P4
  - [-1, 1, MGE, [512]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 1, MGE, [1024]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]] # Detect(P3, P4, P5)